AmbiqAI/neuralSPOT/neuralspot/ns-core/src/apollo510b/armclang/startup_keil6.c
//******************************************************************************
//
// Place code immediately following vector table.
//
//******************************************************************************

#if defined ( __GNUC__ )
#pragma GCC diagnostic pop
#endif

/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
    __set_PSP((uint32_t)(&__INITIAL_SP));

    __set_MSPLIM((uint32_t)(&__STACK_LIMIT));
    __set_PSPLIM((uint32_t)(&__STACK_LIMIT));

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __TZ_set_STACKSEAL_S((uint32_t *)(&__STACK_SEAL));
#endif

    PWRCTRL->SSRAMPWREN_b.PWRENSSRAM = 7;     /* Power up the SSRAM (3MB) blocks */
    SystemInit();                             /* CMSIS System Initialization */

//
// Set the SSRAM non-cacheable for application explicitly requested SSRAM_NON_CACHEABLE
//
#ifdef SSRAM_NON_CACHEABLE
  __DSB();
  //
  // Set up non-cachable MPU region attributes.
  //
  ARM_MPU_SetMemAttr (
    7, // use the last MPU attribute slot
    ARM_MPU_ATTR (
      ARM_MPU_ATTR_MEMORY_ (0, 1, 0, 0),
      ARM_MPU_ATTR_MEMORY_ (0, 1, 0, 0)
    )
  );

  //
  // Set the whole SSRAM non-cacheable
  //
  ARM_MPU_Region_t region;
  region.RBAR = ((0x20080000 & MPU_RBAR_BASE_Msk) |
                 (ARM_MPU_SH_NON << MPU_RBAR_SH_Pos) |
                 (ARM_MPU_AP_(0, 1) << MPU_RBAR_AP_Pos) |
                 (1 << MPU_RBAR_XN_Pos));
  region.RLAR = ((0x2037FFFF & MPU_RLAR_LIMIT_Msk) |
                 (7 << MPU_RLAR_AttrIndx_Pos) |
                 (1));
  ARM_MPU_Load (
    15, // use the last MPU region
    (ARM_MPU_Region_t const*)&region, 1);

  //
  // Enable MPU
  //
  SCB_CleanInvalidateDCache();
  ARM_MPU_Enable((1 << MPU_CTRL_HFNMIENA_Pos) |
                 (1 << MPU_CTRL_PRIVDEFENA_Pos));

#endif // SSRAM_NON_CACHEABLE

    __PROGRAM_START();                        /* Enter PreMain (C library entry point) */
}


#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif



// Pull in CMSIS core defs (SCB, register names)
#include "core_cm55.h"   // or simply "cmsis.h" depending on your tree

// ---- CONFIG ----
// Heuristic code range for "is this a code address?" check.
// Adjust to your SoC memory map (Flash, XIP, ITCM, etc.)
#ifndef CODE_START
#define CODE_START   (0x00410000UL)
#endif
#ifndef CODE_END
#define CODE_END     (0x00800000UL)  
#endif

// How many 32-bit words of stack to scan for potential return addresses
#ifndef BT_SCAN_WORDS
#define BT_SCAN_WORDS  256
#endif

// Maximum number of backtrace entries to print
#ifndef BT_MAX_FRAMES
#define BT_MAX_FRAMES  16
#endif

// Weak linker symbols for stack bounds (typical CMSIS names).
// Provide these in your linker script; we fall back gracefully if missing.
__attribute__((weak)) extern uint32_t __StackTop;
__attribute__((weak)) extern uint32_t __StackLimit;

// Structure of the basic (non-FP) stacked frame pushed on exception entry.
typedef struct {
    uint32_t r0;
    uint32_t r1;
    uint32_t r2;
    uint32_t r3;
    uint32_t r12;
    uint32_t lr;   // return address into the interrupted code
    uint32_t pc;   // program counter at the time of fault
    uint32_t xpsr;
} stacked_regs_t;

static inline const char *which_stack(uint32_t exc_return) {
    // EXC_RETURN bit[2]: 0=MSP, 1=PSP
    return (exc_return & (1UL << 2)) ? "PSP" : "MSP";
}

static inline bool exc_frame_has_fp(uint32_t exc_return) {
    // EXC_RETURN bit[4]: 0 = FP context stacked, 1 = no FP context
    return ((exc_return & (1UL << 4)) == 0U);
}

static inline bool is_thumb_code(uint32_t addr) {
    // On Cortex-M, code addresses are Thumb; return addresses typically have bit0=1.
    return (addr & 0x1U) != 0;
}

static inline bool is_code_addr(uint32_t addr) {
    return (addr >= CODE_START) && (addr < CODE_END) && is_thumb_code(addr);
}

static void print_cfsr_details(uint32_t cfsr) {
    uint32_t mmfsr =  cfsr        & 0xFFU;       // MemManage Faults
    uint32_t bfsr  = (cfsr >> 8)  & 0xFFU;       // Bus Faults
    uint32_t ufsr  = (cfsr >> 16) & 0xFFFFU;     // Usage Faults

    if (mmfsr) {
        ns_lp_printf("  MMFSR: 0x%02lx", (unsigned long)mmfsr);
        if (mmfsr & (1U << 0)) ns_lp_printf("  [IACCVIOL]");
        if (mmfsr & (1U << 1)) ns_lp_printf("  [DACCVIOL]");
        if (mmfsr & (1U << 3)) ns_lp_printf("  [MUNSTKERR]");
        if (mmfsr & (1U << 4)) ns_lp_printf("  [MSTKERR]");
        if (mmfsr & (1U << 5)) ns_lp_printf("  [MLSPERR]");
        if (mmfsr & (1U << 7)) ns_lp_printf("  [MMARVALID]");
        ns_lp_printf("\r\n");
    }

    if (bfsr) {
        ns_lp_printf("  BFSR:  0x%02lx", (unsigned long)bfsr);
        if (bfsr & (1U << 0)) ns_lp_printf("  [IBUSERR]");
        if (bfsr & (1U << 1)) ns_lp_printf("  [PRECISERR]");
        if (bfsr & (1U << 2)) ns_lp_printf("  [IMPRECISERR]");
        if (bfsr & (1U << 3)) ns_lp_printf("  [UNSTKERR]");
        if (bfsr & (1U << 4)) ns_lp_printf("  [STKERR]");
        if (bfsr & (1U << 5)) ns_lp_printf("  [LSPERR]");
        if (bfsr & (1U << 7)) ns_lp_printf("  [BFARVALID]");
        ns_lp_printf("\r\n");
    }

    if (ufsr) {
        ns_lp_printf("  UFSR:  0x%04lx", (unsigned long)ufsr);
        if (ufsr & (1U << 0))  ns_lp_printf("  [UNDEFINSTR]");
        if (ufsr & (1U << 1))  ns_lp_printf("  [INVSTATE]");
        if (ufsr & (1U << 2))  ns_lp_printf("  [INVPC]");
        if (ufsr & (1U << 3))  ns_lp_printf("  [NOCP]");
        if (ufsr & (1U << 8))  ns_lp_printf("  [UNALIGNED]");
        if (ufsr & (1U << 9))  ns_lp_printf("  [DIVBYZERO]");
        ns_lp_printf("\r\n");
    }
}

// --- Armclang/Keil stack symbols (scatter file) ---------------------------
// We alias the linker symbol names (with $$ in them) to C identifiers.
__attribute__((weak)) extern const uint32_t __arm_stack_base  __asm("Image$$ARM_LIB_STACK$$Base");
__attribute__((weak)) extern const uint32_t __arm_stack_limit __asm("Image$$ARM_LIB_STACK$$Limit");
// Some projects emit ZI variants; declare them too (weak), harmless if absent.
__attribute__((weak)) extern const uint32_t __arm_stack_zi_base  __asm("Image$$ARM_LIB_STACK$$ZI$$Base");
__attribute__((weak)) extern const uint32_t __arm_stack_zi_limit __asm("Image$$ARM_LIB_STACK$$ZI$$Limit");

// Optional Keil startup symbol for the initial MSP (top of main stack)
__attribute__((weak)) extern const uint32_t __initial_sp;

// If you want a hard-coded emergency fallback for your exact .sct (from your post):
// ARM_LIB_STACK 0x20080000 EMPTY - 0x00003000
#ifndef MANUAL_MAIN_STACK_TOP
#define MANUAL_MAIN_STACK_TOP   ((uint32_t *)0x20080000UL)
#define MANUAL_MAIN_STACK_LIMIT ((uint32_t *)(0x20080000UL - 0x00003000UL))
#endif

// Helper: resolve main stack (MSP) bounds for Armclang/Keil.
static void resolve_main_stack_bounds(uint32_t **out_limit, uint32_t **out_top) {
    uint32_t *limit = 0, *top = 0;

    // Prefer non-ZI armclang symbols
    if (&__arm_stack_base)  limit = (uint32_t *)&__arm_stack_base;   // lower address
    if (&__arm_stack_limit) top   = (uint32_t *)&__arm_stack_limit;  // higher address (initial SP)

    // Try ZI variants if needed
    if ((!limit || !top) && &__arm_stack_zi_base)
        limit = (uint32_t *)&__arm_stack_zi_base;
    if ((!limit || !top) && &__arm_stack_zi_limit)
        top   = (uint32_t *)&__arm_stack_zi_limit;

    // Try Keil startup symbol
    if (!top && &__initial_sp) {
        top = (uint32_t *)&__initial_sp;
    }

    // As a robust fallback, read the initial MSP from the vector table (word 0 at VTOR)
    if (!top) {
        uint32_t vtor = SCB->VTOR ? SCB->VTOR : 0x00000000UL;
        top = (uint32_t *)(*(uint32_t *)vtor);
    }

    // If we *still* don’t have a limit, use the manual constants (from your .sct)
    if (!limit) {
        limit = MANUAL_MAIN_STACK_LIMIT;
    }
    if (!top) {
        top = MANUAL_MAIN_STACK_TOP;
    }

    *out_limit = limit;
    *out_top   = top;
}

